---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
source: html/2aa04f16-9297-9429-8989-b3b1dffb5593.htm
---
# ModificationOutsideTransactionException Methods

Retrieves data needed to serialize the target object.